#점화식 끝에 1을 더해주는 이유는 함수의 호출 횟수를 구해야 하기 때문이다.
# a[i] = min(a[i-1], a[i/2], a[i/3], a[i/5]) + 1
# 바텀업
x=int(input())

d=[0]*30001 #앞서계산된 결과를 저장하기 위한 DP테이블 초기화. 결과 저장용 리스트

for i in range(2, x+1): #2~26
  d[i]=d[i-1]+1 
  #d[2]=d[1](=0)+1=1, d[3]=d[2](=1)+1=2, d[4]=d[3](=1)+1=2, d[5]=d[4](=2)+1=3
  #d[26]=d[25](=2)+1=3
  if i%2==0:
    d[i]=min(d[i], d[i//2]+1) 
  if i%3==0:
    d[i]=min(d[i], d[i//3]+1) #d[3](=2), d[1](=0)+1=1 -> 1
  if i%5==0:
    d[i]=min(d[i], d[i//5]+1) #d[5](=3), d[1](=0)+1=1 -> 1 / d[25]=2
    
print(d[x])

'''
26
3
'''
